tcc2/tests/http/performance/results/hey-http-apigw-result.txt

Summary:
  Total:	30.2492 secs
  Slowest:	0.4927 secs
  Fastest:	0.0011 secs
  Average:	0.1751 secs
  Requests/sec:	568.1466
  
  Total data:	274976 bytes
  Size/request:	16 bytes

Response time histogram:
  0.001 [1]	|
  0.050 [122]	|■
  0.099 [4233]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.149 [2189]	|■■■■■■■■■■■■■
  0.198 [6688]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.247 [1181]	|■■■■■■■
  0.296 [2162]	|■■■■■■■■■■■■■
  0.345 [166]	|■
  0.394 [383]	|■■
  0.444 [39]	|
  0.493 [22]	|


Latency distribution:
  10% in 0.0962 secs
  25% in 0.0993 secs
  50% in 0.1919 secs
  75% in 0.1969 secs
  90% in 0.2896 secs
  95% in 0.2939 secs
  99% in 0.3880 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0011 secs, 0.4927 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0100 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.1750 secs, 0.0009 secs, 0.4926 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0038 secs

Status code distribution:
  [200]	17186 responses